package day04;
/**
 * for循环
 *  1）经典的for常用于计次循环。(次数，个数，数列)
 *  2）for循环可以替代其它的循环结构。 
 *
 * 经典的for使用
 *   for(初始化表达式(1);循环条件boolean(2);递增表达式(4)){
 *     循环体。(3)
 *   }
 *   (5)
 * 流程:
 *   (1)->[(2)-true->(3)->(4)]->[(2)-true->(3)->(4)]
 *   ->(2)-false->(5)结束
 * (1)只执行一次！
 * (2)->(3)->(4) 流程反复循环执行
 * (2)-false-> 结束循环流程
 */
public class Demo05 {
	public static void main(String[] args) {
		//经典案例：实现10以内的奇数和 1+3+5+7+9
		int sum = 0;/*0*/
		for(int i=1/*1*/; i<10/*2*/; i+=2/*4*/){
			// i = 1 3 5 7 9 
			sum += i;/*3*/
		}
		System.out.println(sum);/*5*/
// 执行流程：
// (0 sum=0)->(1 i=1)->
//  [(2 1<10)-true->(3 sum=1)->(4 i=3)]->
//  [(2 3<10)-true->(3 sum=4)->(4 i=5)]->
//  [(2 5<10)-true->(3 sum=9)->(4 i=7)]->
//  [(2 7<10)-true->(3 sum=16)->(4 i=9)]->
//  [(2 9<10)-true->(3 sum=25)->(4 i=11)]->
//  (2 11<10)-false->(5 println(25))
	}
}





